{
    "credits": [
        {
            "name": "TemmieZoneNG",
            "professions": "Professional Creator, Professional Gamer, Professional Pro",
            "contributions": "Rodentrap",
            "quote": "Yoyo its temmiezone Yo!! I made da sonic sprites, da bf sprites, and everything about dis mod.... I hope you enjoyed it!!! also, if u havent, u should TOTALLY check out my YouTube channel after this. I don't just make fnf and Undertale fanart you know, im a PRO at cs:go. so if u want to watch me pwn some noobs... subscribe to me!!!! I do sub 4 sub o7. also, if you couldn't tell, i LOVE temmie. temmie from undertale.. I'm genuinely obsessed with this little character, it started when i played Undertale for the first time as a 12 year old. when i saw this little cute motherfucker come up to me, SHIVERING to the point where her face leaves her body, there's no way I couldn't relate to that. it had gotten to the point where i started to sell my home-made temmie flakes at school, to fund my college education.. I didn't even want to go to college before this!! but here i am. you guys should definitely play undertale if you haven't, it's on every signle platform ever at this point and im glad. i can take temmie wherever i want.. also, speaking of school, my GOD is it stressful.. i had to stop working on this mod for a couple weeks just because of essays and finals! it's so dumb, can't they just leave me alone.. i really hope i can graduate this year, or the next, or the year after that (i have failed to graduate several times), but enough with that stuff.... there was this one moment where i went to an anime convention, dressed up as temmie (who would've guessed) and there was this other dude in a bob costume, and we really connected with each other.... it was as if he was my long lost brother.. unfortunately I didn't get to ask him for his socials so i never met him again... Bob guy, if you're reading this, please give me back my fucking wallet you son of a bitch"
        },
        {
            "name": "JoeDoughBoi",
            "professions": "Co-owner of Sonic.EXE, Owner of Legacy, Advisor/Director, Concept artist, Artist",
            "contributions": "Designed and conceptualized Sonic & X sprites, obituary stage, menus, shady guy. Drew obituary phase 2 & 3 sprites, obituary 2nd & 3rd background artist, 2torial+obituary icons",
            "quote": "these fries taste like ass"
        },
        {
            "name": "Doorknob",
            "professions": "Co-Director, Co-Lead Artist, Concept Designer, Boyfriend Manager",
            "contributions": "Assist Designed the Art Style of the mod, Designed the Desktop Menu, Made the 2torial Background and Rodentrap Sonic, Additional help on Obituary Background, Drew the Credit Icons and Portraits, and Made most of Boyfriend's Assets",
            "quote": "What can I say? I'm a sore loser. Also, go play Eastward."
        },
        {
            "name": "Gibz",
            "professions": "Director, Charter",
            "contributions": "Charted 2torial and Obituary",
            "quote": "saved the mod like 3 times.\nslow motion is better no then motion"
        },
        {
            "name": "Raven",
            "professions": "Director, Concept Artist, Writer",
            "contributions": "Made concepts for Obituary's Background, Wrote dialogue for 2011 X and Shady Guy. Character direction for Shady Guy and 2011 X, level direction for Obituary",
            "quote": "joe, why did you eat my fries"
        },
        {
            "name": "Adrix",
            "professions": "Sprite Artist, Background Artist, Animator",
            "contributions": "Tweaked 2torial Sonic sprites, Obituary 1st background artist, Cutscene animator, Bunny kick animator, Shaded Obituary Phase 3 sprites, fire animator for Obituary",
            "quote": "hello my pe causas"
        },
        {
            "name": "ScorchVx",
            "professions": "Concept artist",
            "contributions": "Background bird corpse animation, Phase 3 pose concepts, scrapped X concepts",
            "quote": "Get Real https://vxtwitter.com/ScorchVx/status/1742819506370814183"
        },
        {
            "name": "PaigeyPaper",
            "professions": "Artist, Animator, Coder",
            "contributions": "Animated 2011 X Phase 3 Poses, Animated Boyfriend's Death and Hurt anims. Coded the Legacy Title Screen, Desktop Main Menu, Song Selection Screen, Credits Menu (hi guys), and Cursor. Made the Rodentrap Intro Video",
            "quote": "i have a message to say to all the players out there.... a POWERFUL message... that will change the course of their lives.... forever.......hi guys :)"
        },
        {
            "name": "MochaDrawss",
            "professions": "Artist, Animator",
            "contributions": "Animated 2011 X Phase 2 Poses, Animated Boyfriend's Idle and all poses, helped on Obituary Chart",
            "quote": "you are what you eat"
        },
        {
            "name": "Rhysamath",
            "professions": "Sprite Artist, Background Artist, Menu Artist, Animator",
            "contributions": "Worked on Shady Guy sprites, animated Legacy menu, animated background fire and smoke of Obituary",
            "quote": "Huh? Sorry- I was Interloping.. I have something important for you\nhttps://www.youtube.com/watch?v=daKa1Q0Tueg\nCan you look at it? Actually, no question. Look at it.\nIt's imperative."
        },
        {
            "name": "Erick Animations",
            "professions": "Sprite artist, animator",
            "contributions": "Free4Me original Sonic sprites, animating 2torial Sonic",
            "quote": "Joe told me to draw, so i did"
        },
        {
            "name": "CommandoDev",
            "professions": "Artist",
            "contributions": "Made the Rodentrap Logo and Main Menu BG",
            "quote": "Sometimes when I fell over and dropped all my packages I’d take my frustration out by shaking the shit out of the baby until she started crying"
        },
        {
            "name": "Red3127",
            "professions": "Artist, Animator, Charter",
            "contributions": "Made most of Shady Guy's Assets and Animations, Assisted on Obituary Phase 3's Fire Animation, Drew and Animated Sonic's Spindash, Assisted in Obituary Chart",
            "quote": "AAAAAGOOBAGOOBAGOOBA AAAAA"
        },
        {
            "name": "Sturm",
            "professions": "Musician, Sound designer",
            "contributions": "Recorded Provoud Keyboard Clacks, Real Menu Ambiance, Shop Ambiance, Composed Shop Music, co-produced Obituary, Composed the True Intro music",
            "quote": "Function one into Function two True Combo Alternation Function Four BYE BYE"
        },
        {
            "name": "Bwend",
            "professions": "Musician",
            "contributions": "2torial composer, Obituary composer",
            "quote": "meow"
        },
        {
            "name": "MarStarBro",
            "professions": "Musician",
            "contributions": "Composed the Rodentrap Intro Song and Rodentrap Main Menu BGM",
            "quote": "Djent is not a genre (only some will get it)"
        },
        {
            "name": "Sector03",
            "professions": "Coder",
            "contributions": "Programmed some of the Rodentrap Title Screen, Rodentrap Main Menu, and very early versions of Legacy",
            "quote": "sonic.exe vs goku"
        },
        {
            "name": "Data",
            "professions": "Coder",
            "contributions": "Programmed Shady Guy's Room, most of Obituary Events, Obituary Phase 3 BG,reworked the engine, and did a lot of bugfixing (bless you -Paige)",
            "quote": "hrllo i am data 5 i am fre -infry"
        },
        {
            "name": "DuskieWhy",
            "professions": "Coder",
            "contributions": "Programmed the Engine, 2torial, part of Obituary, the Options menu, and more",
            "quote": "I'd like to thank my family, friends, Chica from Five Nights at Freddy's, Srife5 for the theory on the gongas, Shoutout to legos and coloring books (i LOVE having fun), monster trucks and firetrucks along with drawing and blowing bubbles."
        },
        {
            "name": "RedTV53",
            "professions": "Voice Actor",
            "contributions": "Voice of Shady Guy in the gallery menu (or Jerma, as they like to call him)",
            "quote": "check out this cool video: https://youtu.be/BoGeRRN5AIc."
        },
        {
            "name": "Landy",
            "professions": "Voice Actor",
            "contributions": "Voice of Fake Sonic",
            "quote": "i still can't log into Helldivers 2"
        },
        {
            "name": "Madzilla",
            "professions": "Voice Actor",
            "contributions": "Voice of X's laugh",
            "quote": "live"
        },
        {
            "name": "Funkin' Team",
            "professions": "made fnf",
            "contributions": "Everything",
            "quote": "beep"
        },
        {
            "name": "Sonic Team",
            "professions": "made sonic",
            "contributions": "made sonic",
            "quote": "aw yeah!"
        }
    ]
}